{"meta":{"title":"覃","subtitle":"","description":"","author":"Qin Yue","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"模块度(Modularity)发展历程","slug":"Modularity","date":"2020-01-21T18:29:07.000Z","updated":"2020-01-21T19:24:06.192Z","comments":true,"path":"2020/01/22/Modularity/","link":"","permalink":"http://yoursite.com/2020/01/22/Modularity/","excerpt":"","text":"与小世界性[1]、无标度等基本统计特性相并列，Girvan&amp;Newman[2]在2001年发现的网络社区结构（network community structure）是复杂网络最普遍和最重要的拓扑结构属性之一，具有相同社区节点相互连接密集、不同社区节点相互连接稀疏的特点，如图1所示。复杂网络中的社区发现方法目的在于揭示出复杂网络中真实存在的网络社区结构。 为了度量实际网络中社区发现方法的好坏，Newman[3]于2004年提出了一个用于测度复杂网络中社区划分质量指标——模块度（Modularity）。在这之后，许多研究者以模块度函数作为目标函数，提出了一系列基于模块度最优的社区发现算法。 # 模块度的定义与发展 ## 1.1原始定义（Q1） 1.1.1 迹（Trace） 对于一个给定的网络G，将其划分为q个社区，我们用一个的对称矩阵e来表示该划分，e中的每个元素表示连接社区i与社区j的边在G的全部边中所占的比例，显然有。矩阵e的迹表示连接社区内部节点的边的占比，一个好的社区划分应该有一个数值很高的迹。 但研究发现，单独使用迹在一些情况下无法很好地测度划分质量，例如这样一个平凡划分：将所有点放到同一个社区中。此时为最大值，但该划分在绝大部分情况下显然不具有任何意义。 1.1.2 模块度（Q1） Newman[3]认为，考虑一个与G具有相同社区划分、相同边数但节点间随机连接的随机网络，若G具有社区结构，社区内部边占总边数的比例应该大于随机情况下的该比例的期望。实际社区内部边与期望的差越大，说明网络与随机网络的差异越大，即网络越具有社区结构。 令表示与社区i连接的边的占比，全部社区内部边的占比的期望为 （1） 则模块度定义为 （2） 理论上，，但取值为的情况是极为罕见的。G的一个社区划分的模块度为正数时，表明社区结构可能存在。在该定义下，平凡划分（.将所有点放到同一个社区中）的模块度为。 1.2 考虑节点度的模块度（Q2） 上述定义是简单且直接的，但存在一个问题：在构建随机网络时，没有考虑到原网络G的节点度。由于节点的度在一定程度上能够表示该节点被连接的概率，所以Newman[4]于2006年对模块度进行了重新定义。 考虑一个具有n个节点的无向无权网络，我们可以用它的邻接矩阵A来表示该网络。A是一个的对称矩阵，通常来说 （3） 一般地，我们约定。在允许多重边存在的网络中，允许取比1大的值。 将网络划分为q个不重叠的社区，令表示节点i所在的社区，则是对网络的一个划分。对于一个特定的划分g，网络的社团内部边的数量为，其中是一个克罗内克函数（Kronecker delta）： （4） 对于随机网络，保持原网络G的边数m与各节点的度不变，将这m条边随机地重新定位到任意两个节点间。随机化后，令表示节点i与j相连接的概率，则社区内部边数的期望值为。故重新定义的模块度为： （5） 对于一个特定的网络，模块度的大小与m不相关，仅与社区划分有关。这一定义使用边数的比例而不是边数的绝对值，这使得不同规模的网络划分的模块度可以进行比较。 注意到，此时平凡划分的模块度为： （6） 因为在随机化中，网络中边的数量被视为常数，即。 现在需要确定如何计算。这个值依赖于我们用来做随机化的方案。一个简单的方案是，对于任意两个节点i和j，令它们具有相同的连接概率，即对于给定边数m、节点数n的网络，有： （7） 理论上说，这里应该是节点i与节点j之间的边数的期望而不是i与j相连接的概率，但由于，故期望与概率很接近。 然而实际上，节点间的连接很大程度上依赖于节点的度，但如（7）式表示的没有考虑到节点的度。因此，我们需要一个能够保持节点度数的带约束随机化方案。这里，Newman使用了configuration model产生随机图集合[5],[6]。随机化后，两个节点之间的连接概率为 （8） 其中是节点i的度。 至此，我们得到了重新定义的模块度： （9） Newman指出，在实践中，好的划分的Q值应当取值在0.3~0.7之间，更高的数值是很罕见的。这一重新定义的模块度也是目前使用范围最广的模块度。 1.3 分辨率限制与广义模块度（Q3） 1.3.1 分辨率限制（Resolution Limit） 根据Fortunato&Barthelemy[7]的研究成果，在对（9）式进行最优化来寻找社团划分时有一个缺点：无法找出那些实际具有许多小社团的网络中的社团划分。特别地，当网络中的社团数大于时，通过使（9）最大化找到的社团划分与正确划分可能不符——基于（9）的模块度最优化方法寻找到的社区划分倾向于将一个个小社区合并成更大的社区，这样使得基于模块度最优的方法不能发现网络中较小的社区。 1.3.2 广义模块度（Generalized Modularity） 为了解决上述问题，Arenas[8]在2008年基于Reichardt&Bornholdt[9]在2006年对启发式概念与汉密尔顿函数（Hamiltonian）的推导与讨论，提出了一个广义模块度的概念： （10） 显然，（9）定义的模块度为（10）的一个特殊情况（）。 1.4 对于Q3中参数的一些补充说明 Q3与Q2的区别在于参数，称为分辨率参数（resolution parameter）。这使得Q3优化法比Q2优化法具有更高的灵活性，能够发现更多结构下的网络社区划分。但即便是这样，模块度优化法也存在一定的问题。 Lancichinetti&Fortunato[10]在2012年证实了多分辨率模块度（Q3）存在着一个问题：当取较小的值时，倾向于将小的社团合并为大社团；当大时，倾向于将大社团分裂在社团大小分布不一的网络中。而我们不可能同时消除这两种偏差，Q3也无法发现正确的社区结构。 Jeub、Sporns&Fortunato[14]等人指出，最佳划分应当对应于分辨率参数取正确值的位置。但是在缺乏关于网络的先验知识的情况下，预先确定是很困难的，尽管Newman[11]于2015年证明了基于Q2优化的社区发现算法在特定情况下与极大似然估计方法等价，将模块度优化法与随机块模型（Stochastic Block Model,SBM）、种植分区模型（Planted Partition Model,PPM）联系了起来，并提出了一种可能的计算方法。 二．Newman,2015 2.1 随机块模型（Stochastic block model） 2.1.1 模型及参数定义 参数 参数说明 m 网络中的边数 n 网络中的节点数 q 网络中划分的社团数 社团r与社团s的连接概率 g 一个n维向量（社团划分） A 一个的对称矩阵（邻接矩阵） 一个的对称矩阵（社团邻接矩阵） 随机块模型是一种生成随机图的模型。给定网络的先验信息m、n、q以及和g，将m条边随机分配到各节点之间形成一个随机网络。 2.1.2 随机块模型的一些说明 Newman指出，随机块模型生成随机网络的过程中，连接任意两个节点i和j的边的数量通常不是随机的，而是服从以为参数的Poisson分布，其中r、s分别为节点i和j所在的社团。至此，可以得出随机块模型假设网络A的连接的生成过程为： 1)将网络中每个节点i以概率分配到第k个社区，为一个q维向量，节点i的社区变量用表示： 2)每对节点产生连接的概率服从Poisson分布，即。 因此在理论上，在生成的随机网络中，一对节点之间可能存在多条边，并且允许存在节点自己与自己相连接的情况。与其他情况不太一样的是，节点与自身相连边的数量服从以为参数的Poisson分布。（实际上，还有另一个Bernoulli分布版本的随机块模型，也适用于往下得出的结论，但Newman在文章中仅给出了Poisson分布版本） 上述随机网络的假设在某些情况下是适用的，例如论文引用网络与万维网超链接网络：一篇论文可在另一篇论文中被重复引用，一个网页在另一个网页中也可能被重复引用。在其他大多数情况下，上述随机网络显然不太符合现实。但由于大部分的现实网络是非常稀疏的，这意味着边连接概率非常小。因此在这种情况下，网络中多重边与自连边的密度很小，通常可以忽略不计。 2.2 基于随机块模型的极大似然估计法 上述随机块模型是基于先验信息生成一个随机网络。而社区发现算法则与其相反，是根据给定的观测网络来推断社区划分。具体地，这里希望求出的参数是：边的概率和社团成员。 假定一个邻接矩阵为A的观测网络由一个参数为和g的Poisson形式的随机块模型生成，则观测网络由该随机块模型生成的概率为： （11） 这里约定A的对角线元素，而不是通常的取值1。这一概率的最大值所对应的和g就是最可能产生观测网络的参数值。 对（11）式取对数形式得： （12） 其中、、与两个参数独立，不影响该概率的最大值，将其视为常数并忽略掉，则上式简化为： （13） 2.3 度修正块模型（Degree-corrected block model，DCBM） 如同1.1节中Q1所犯的错误一样，随机块模型没有考虑到节点度的影响。这导致该模型（无论是Bernoulli形式还是Poisson形式）生成了一个具有Poisson（或Bernoulli）度分布的网络，这与经验网络中的广泛分布非常不同。 为了解决这一问题，Karrer与Newman[12]在2011年提出了一个度修正块模型（以下简称DCBM），将连接节点i与j的边数的期望值由改为了，其中自连边的期望保持不变。与1.2节中一样，是随机化时节点i与j的连接概率，代表两个社团之间相连接的概率。 遵循与2.2中相同的推导思路，忽略那些对极大似然估计值的位置没有影响的因素，得到 （14） 至此，社区发现算法转化为：寻找合适的与g使（14）最大化，以寻找出与观测网络最匹配的社区划分。 2.4 种植分区模型（Planted Partition Model，PPM） PPM是随机块模型的一个特例，其描述社团结构的参数仅取两个值： （15） 这意味着它假设各个社团拥有相同的社团内部、社团间连接概率。根据（15）可得： （16） （17） 将（16）、（17）代入（14）得 （18） 其中，B与C是仅与和有关、与g无关的常数，且 （19） 为了进行社区发现，现在要将（18）这个关于社区分配g与参数、的函数最大化。假设我们已知正确参数和，那么当且仅当获得正确的g时，该值最大。 注意到，（18）除开两个常数B与C外，与（10）并没有什么不同。由此可知，（18）与（10）在相同位置上取到最大值，即已知参数和的PPM的极大似然估计法与以（19）为参数的广义模块度最优法等价。 2.5 解析参数的值 要求解正确的，只需求出与，这里使用迭代方法来进行求解。其思想为，先设定一个初始的值，利用模块度最优法获取一个社区划分，对该划分，社团内部边的期望为： （20） 其中表示社团r中所有节点的度的和。由（20）可得 （21） 同理可得 （22） 实际计算时，使用所有社团内部边的观测值来表示。 综上，总结求解解析参数的步骤如下： 1)给设定一个初始值； 2)接着，根据给定的网络、、社团数目q，根据模块度最优法寻找社团划分； 3)基于该社团划分，计算，获得新的模块度函数； 4)重复2)和3)，直到社团结构不再改变，获得正确的与社团划分。 2.6 一些补充说明 模块度最优法与极大似然估计法的等价说明了： 1)随机块模型统一假设网络具有Poisson度分布，使得拟合网络与真实网络的近似性很差。相比之下，度修正模型适合任何度分布网络。如Bickel和Chen[13]的研究成果显示，在适当的条件下，模块度最优得到的社区结构是正确且无偏的。 2)的符号取决于和的大小。当时，原结论成立；当时，极大似然估计与模块度最小化法等价。 3)Newman假设仅取两个值：、，这意味着任意社团内部、任意两个社团之间的连接程度相同，这与现实不符。故该指标虽然在理论上有所依托，但实际运用时还存在较大困难。 4)关于Newman提出的计算方案的疑惑：在2.4节中，Newman令时，作出的假设是“B与C是仅与和有关，与g无关的常数”。但在2.5节计算参数时，的取值与、两个数有关。其中代表社团r内部节点的度数之和。显然，不同的社团划分方案（即g）对应着不同的值，与2.4中作出的结论矛盾。 参考文献 [1]Watts DJ, Strogatz SH. Collective dynamics of ‘small-world’ networks. Nature, 1998,393(6638):440-442. [2]Girvan M, Newman M E J. Community structure in social and biological networks. Proc. of the National Academy of Science, 2002,99(12):7821-7826. [3]Newman M E J, Girvan M. Finding and evaluating community structure in networks. Phys. Rev. E, 2004,69(2):026113. [4]Newman M E J. Modularity and community structure in networks. Proc. of the National Academy of Science, 2006,103(23):8577-8582. [5]Molloy M, Reed B. A critical point for random graphs with a given degree sequence. Random Structures and Algorithms,1995,6:161-179 [6]Newman M E J, Strogatz SH, Watts DJ. Random graphs with arbitrary degree distributions and their applications. Phys. Rev. E,2001,64:026118. [7]Fortunato S, Barthelemy M. Resolution limit in community detection. Proc. of the National Academy of Science,2007,104(1):36-41. [8]Arenas A, Fernandez A, Gomez S. Analysis of the structure of complex networks at different resolution levels. New Journal Of Physics,2008,10:053039. [9]Reichardt J, Bornholdt S. Statistical mechanics of community detection. Phys. Rev. E,2006,74(1):016110. [10]Lancichinetti A, Fortunato S. Limits of modularity maximization in community detection. Phys. Rev. E,2011,84(6):066122. [11]Newman M E J. Equivalence between modularity optimization and maximum likelihood methods for community detection. Phys. Rev. E,2016,94(5):052315. [12]Karrer B, Newman M E J. Stochastic blockmodels and community structure in networks. Phys. Rev. E,2011,83:016107. [13]Bickel PJ, Chen A. A nonparametric view of network models and Newman-Girvan and other modularities. Proc. of the National Academy of Science,2009,106:21068-21073. [14]Jeub L G S, Sporns O, Fortunato S. Multiresolution Consensus Clustering in Networks. Scientific Reports,2018,8:3259.","categories":[],"tags":[{"name":"复杂网络, 社区发现","slug":"复杂网络-社区发现","permalink":"http://yoursite.com/tags/%E5%A4%8D%E6%9D%82%E7%BD%91%E7%BB%9C-%E7%A4%BE%E5%8C%BA%E5%8F%91%E7%8E%B0/"}]}]}